#ifndef _FTEXT_H_
#define _FTEXT_H_

/*
 *创建一个文本
 */
void*
ftext_create(char* txtName,int texw,int texh,int fw,int fh);
/************************************************************************/
/* 在指定坐标设置一个字符数据(一个汉字或者是一个英文)
/************************************************************************/
void 
ftext_set(void* p,char* s,int x,int y,int* pw,int* ph);

/*
 *	设置文本的屏幕坐标
 */
void 
ftext_setpos(void* p,int x,int y);

/*
 *	将str字符串转换成贴图数据展示出来,该接口会增量增加后续的文本渲染
 */
void
ftext_parse(void* p,const char* str,int *w,int *h);
/************************************************************************/
/* 擦除掉所有的文本字体                                                                   */
/************************************************************************/
void
ftext_clear(void* p);
/************************************************************************/
/* 显示隐藏                                                                     */
/************************************************************************/
void
ftext_vis(void* p,int vis);
char* 
ftext_get_str(void* p);
/************************************************************************/
/* 销毁字体句柄                                                                     */
/************************************************************************/
void
ftext_dispose(void* p);
/************************************************************************/
/* 设置文本对象的输入缓冲区大小,当文本数据需要更大的缓冲区的时候可以调用改接口修改                              
/************************************************************************/
void
ftext_set_buffer(void* p,int bufferSize);
#endif